## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_docdb_cluster_instance.ai-answers-docdb-instance[1]` |
| update | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]` |
|        | `aws_security_group.ai-answers-docdb-sg`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] will be updated in-place
  ~ resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
        id                           = "ai-answers-docdb-instance"
      ~ instance_class               = "db.t3.medium" -> "db.r5.large"
      ~ tags                         = {
            "CostCentre" = "ai-answers-staging"
          + "Temporary"  = "true"
            "Terraform"  = "true"
        }
      ~ tags_all                     = {
          + "Temporary"  = "true"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[1] will be created
  + resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = "ai-answers-docdb-cluster"
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "ai-answers-docdb-instance"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.large"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "CostCentre" = "ai-answers-staging"
          + "Temporary"  = "true"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "ai-answers-staging"
          + "Temporary"  = "true"
          + "Terraform"  = "true"
        }
      + writer                          = (known after apply)
    }

  # aws_security_group.ai-answers-docdb-sg will be updated in-place
  ~ resource "aws_security_group" "ai-answers-docdb-sg" {
        id                     = "sg-04966047bf236b850"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow DocumentDB cluster to receive requests from ECS"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-085c606383f33733e",
                ]
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "ai-answers-example-docdb-sg"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
